def sum_array(arr):
    total = 0
    for num in arr:
        total += num
    return total

#ეს კოდი სწორია, რადგან ის განსაზღვრავს ფუნქციას sum_array, რომელიც იღებს მასივის arr-ს, როგორც შეყვანას 
# და აბრუნებს მასივის ყველა ელემენტის ჯამს. კოდი იყენებს for loop-ს მასივის 
# ელემენტებზე გამეორებისთვის და თითოეულ ელემენტს ამატებს გაშვებულ ჯამში, რომელიც შემდეგ ბრუნდება.


def average_array(arr):
    return arr[0]

#ეს კოდი არასწორია, რადგან ის სწორად არ ითვლის მასივის საშუალოს. კოდი უბრალოდ აბრუნებს 
# მასივის პირველ ელემენტს, რომელიც არ არის საშუალო.
# საშუალოს გამოსათვლელად კოდი უნდა შეაჯამოს მასივის ელემენტები და გაყოს მასივის სიგრძეზე.